<?php

$token = "8929716589:AAGy6Ir6hkQlF_RoWKdSMQtXqStKIqk8jMs"; #التوكن حق البوت 
$admin = 6525785749; #ايدي الادمن
$ch1=-1003313387611; #ايدي قناة المشتريات
$ch2=-1003397685474; #ايدي قناة الناجحة
$ch3=-1002991395093; #ايدي قناة التفعيلات
$ch4="https://t.me/K555DD"; #يوزر قناة التفعيلات او رابطها
$ch5=-1002096907442; #ايدي قناة الاشتراك الاجبارب
$ch6 = "https://t.me/K55DD"; # معرف او رابط قناة الاشتراك الاجباري
$api_key = "5qu6cfg785yxf88g6tgr"; # api key حق الموقع 
$invitePoint = 0.0; #الربح من دعوة الرابط
$requestPointMsg = "
لشحن حسابك قم بالتواصل مع الادارة @AAAKP
او بالتواصل مع احد الوكلاء في البوت
"; # رسالة شحن الرصيد
$supportMsg = "
في حالة واجهت اي مشكلة قم بالتواصل معنا عبر اليوزر التالي 
" ; #رسالة الدعم

$botUser="SP1BOT"; // يوزر البوت بدون @

$supportLink = "https://t.me/AAAKP";//التواصل مع الدعم
$requestLink = "https://t.me/AAAKP"; //التواصل مع الي يشحن رصيد
